#+title: A functional approach to checking leap years
#+export_file_name: README
#+author: Benjamin Piper

#+property: header-args :noweb yes :results output :cache yes

** Arrow functions

Let's start from square one.

In order to construct ~isLeapYear~, I've made some arrow functions to help. An arrow function contains ~=>~ s. They come with a few quirks. Two differences that are immediately relevant are:

- If they are only one statement, there is no need for ~return~ or curly braces.
- They are a terser alternative of writing functions. As such, they are useful for writing /curried functions/.
- And more can be seen on the [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions][MDN Web Docs]].

#+NAME: square-fn 
#+BEGIN_SRC js :exports none
const square = x => x * x;
#+END_SRC

#+BEGIN_SRC js
<<demonstration-purposes-only>>
<<square-fn>>
const sum = (x, y) => x + y;
const getStringInitial = string => {
    const firstLetter = string[0];
    return firstLetter.toUpperCase();
}
console.log(square(2)); // >> 4
console.log(sum(2,3)); // >> 5
console.log(getStringInitial("hello")); // >> H
#+END_SRC

#+RESULTS[b0223fd8155d1b0877805f3e6bbbd23abc81d779]:
: 4
: 5
: H

** Curried functions

[[https://en.wikipedia.org/wiki/Currying][Curried functions]] are ones that can have their arguments called one at a time. With each call, a new function is returned. When all parameters have been supplied, the value is returned. Here's what happens when we curry the sum function that we defined earlier.

#+NAME: curried-sum-fns
#+BEGIN_SRC js :exports none
const sum = x => y => x + y;
const add5 = sum(5);
const add24 = sum(24);
#+END_SRC

#+BEGIN_SRC js
<<curried-sum-fns>>

console.log(add5(10)); // >> 15
console.log(add24(18)); // >> 42
console.log(sum(5)(24)); // >> 29
#+END_SRC

#+RESULTS[c6a4639cd4c7322899acdd6b5a7039ffbbaeaf22]:
: 15
: 42
: 29

In this manner, currying makes it easier to create callbacks: functions that are passed as parameters. This leads us to our first three callbacks.

#+NAME: not-fn
#+BEGIN_SRC js :exports none 
const not = boolFn => x => !boolFn(x);
#+END_SRC

#+NAME: divisible-fns
#+BEGIN_SRC js
<<not-fn>>

const isDivisibleBy = divisor => number => number % divisor === 0;
const notDivisibleBy = compose(not, isDivisibleBy);
#+END_SRC

*** Composing Boolean Functions

Last but not least, let's explain ~and~ and ~or~.

#+NAME: and-or-fns
#+BEGIN_SRC js :exports none
const and = (...boolFns) => input => boolFns.every(boolFn => boolFn(input));
const or = (...boolFns) => input => boolFns.some(boolFn => boolFn(input));
#+END_SRC

#+BEGIN_SRC js
const isGreaterThan3 = x => x > 3;
const isLessThan5 = x => x < 5;
const isEqualTo10 = x => x === 10;

<<and-or-fns>>

const between3And5 = and(isGreaterThan3, isLessThan5);
const is10OrLessThan5 = or(isEqualTo10, isLessThan5);

console.log(between3And5(4)); // >> true
console.log(is10OrLessThan5(10)); // >> true
#+END_SRC

#+RESULTS[c5de3b8362f21d6d0caa79e920a28a8809c340e6]:
: true
: true

- The ~every~ method returns true if *all* elements in an array pass the test.
- The ~some~ method returns true if *at least one* element in an array passes the test.
  
The test must be a boolean-returning callback. All I have done here is make the test about /the elements returning an output/ from the /specified input/. This is similar to the earlier-defined ~allFnsAreEqual~.

